#+TITLE: Emacs Config
#+AUTHOR: nls
#+STARTUP: overview
#+PROPERTY: header-args :cache yes :tangle ~/.emacs.d/init.el :mkdirp yes :padline no :async

* MELPA
  MELPA is the defacto standard package manager for emacs. This snippet was taken from [[https://melpa.org/#/getting-started][The MELPA Website]].

#+BEGIN_SRC elisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

#+END_SRC
#+RESULTS[e9d5242741a5c0a2659e131c65b10e2e22a4c533]:
: ((melpa . https://melpa.org/packages/) (elpa . https://elpa.gnu.org/packages/))

* evil
#+BEGIN_SRC elisp
;;; UNDO
;; Vim style undo not needed for emacs 28
(use-package undo-fu)

;;; Vim Bindings
(use-package evil
  :demand t
  :bind (("<escape>" . keyboard-escape-quit))
  :init
  ;; allows for using cgn
  ;; (setq evil-search-module 'evil-search)
  (setq evil-want-keybinding nil)
  ;; no vim insert bindings
  (setq evil-undo-system 'undo-fu)
  :config
  (evil-mode 1))

;;; Vim Bindings Everywhere else
(use-package evil-collection
  :after evil
  :config
  (setq evil-want-integration t)
  (evil-collection-init))







#+END_SRC 
#+RESULTS[2e8f35d0b930d397d02203d6dc4dc18c26177b0b]:
: 4

** General Global Settings
Changing a few things around to make emacs feel and act more like I want it to.
The auto-revert setting is enabled because tangle / detangle for literate programming will change contents of files.
If the file is open in a buffer, I want it to automatically show the change without asking me every time.

#+BEGIN_SRC elisp
    (global-set-key (kbd "C-s") 'save-buffer)
    (global-set-key (kbd "C-S-s") 'write-file)
    (global-auto-revert-mode t)
    (tool-bar-mode 0)
    (scroll-bar-mode 0)
    (cua-mode 1)
    ;; path stuff for macOS
    (add-to-list 'exec-path "/usr/local/bin")

#+END_SRC

#+RESULTS[5ac3972033b408dc44acfce821d7009cdb63f7bc]:
| /usr/local/sbin | /usr/local/bin | /usr/bin | /usr/lib/jvm/default/bin | /usr/bin/site_perl | /usr/bin/vendor_perl | /usr/bin/core_perl | /var/lib/snapd/snap/bin | /home/nls/tools/node-v14.15.4-linux-x64/bin | /home/nls/.local/bin | /home/nls/.bin | /usr/local/sbin | /usr/local/bin | /usr/bin | /usr/bin/site_perl | /usr/bin/vendor_perl | /usr/bin/core_perl | /var/lib/snapd/snap/bin | /home/nls/cpp/ | /home/nls/py/pytools | /home/nls/py/cnav | /home/nls/.fzf/bin | /home/nls/sys_cfg | /home/nls/py/lib | /usr/lib/emacs/27.2/x86_64-pc-linux-gnu |

Set Up Good Defaults. Taken from [[https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org#use-better-defaults][here]]

#+begin_src elisp
;; (set-frame-font "Menlo 15" nil t)
(load-theme 'nord t)

(setq-default
 ad-redefinition-action 'accept                   ; Silence warnings for redefinition
 auto-window-vscroll nil                          ; Lighten vertical scroll
 confirm-kill-emacs 'yes-or-no-p                  ; Confirm before exiting Emacs
 display-time-default-load-average nil            ; Don't display load average
 display-time-mode 0                              ; Display time in frames
 display-time-format "%H:%M"                      ; Format the time string
 fill-column 80                                   ; Set width for automatic line breaks
 scroll-bar-mode nil
 display-line-numbers-type nil
 help-window-select t                             ; Focus new help windows when opened
 indent-tabs-mode nil                             ; Stop using tabs to indent
 inhibit-startup-screen t                         ; Disable start-up screen
 initial-scratch-message ""                       ; Empty the initial *scratch* buffer
 left-margin-width 1 right-margin-width 1         ; Add left and right margins
 mouse-yank-at-point t                            ; Yank at point rather than pointer
 ns-use-srgb-colorspace nil                       ; Don't use sRGB colors
 select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
 sentence-end-double-space nil                    ; End a sentence after a dot and a space
 show-trailing-whitespace nil                     ; Display trailing whitespaces
 split-height-threshold nil                       ; Disable vertical window splitting
 split-width-threshold 1                          ; Disable horizontal window splitting
 tab-width 4                                      ; Set width for tabs
 uniquify-buffer-name-style 'forward              ; Uniquify buffer names
 window-combination-resize t                      ; Resize windows proportionally
 x-stretch-cursor t                               ; Stretch cursor to the glyph width
 scroll-step 1
 scroll-conservatively 10000)

(delete-selection-mode 1)                         ; Replace region when inserting text
(display-time-mode 0)                             ; Enable time in the mode-line
(fset 'yes-or-no-p 'y-or-n-p)                     ; Replace yes/no prompts with y/n
(menu-bar-mode 0)                                 ; Disable the menu bar
(put 'downcase-region 'disabled nil)              ; Enable downcase-region
(put 'upcase-region 'disabled nil)                ; Enable upcase-region
(set-default-coding-systems 'utf-8)               ; Default to utf-8 encoding

#+end_src

Apparently Garbage Collecting when out of focus can make emacs feel faster. I'll try that.

#+begin_src elisp
  (add-hook 'focus-out-hook #'garbage-collect)

#+end_src

#+RESULTS[fa1d73674c306882088317f09677e78c8fc2f746]:
| garbage-collect |

